---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryLinearRestraintZ
source: html/764d7a35-69f1-941e-3f1e-a349f4c278c6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryLinearRestraintZ Property

"Z Spring Modulus"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryLinearRestraintZ { get; }
```